; domain
;Header and description

(define (domain dominio)

;remove requirements that are not needed
(:requirements :strips :fluents :typing :negative-preconditions :disjunctive-preconditions)

(:types ;todo: enumerate types and their hierarchy here, e.g. car truck bus - vehicle
box crane pallet dock conveyor height - object
)

(:predicates ;todo: define predicates here
(clear ?b - (either box pallet crane conveyor))  ;there's nothing above the box the pallet or box, oor the crane is empty
(on ?b1 - box ?b2 - (either pallet crane box conveyor)) ;box b1 is either above other box, a pallet or a crane
(at ?b - (either box crane pallet) ?d - dock )
(origin ?c - conveyor ?d - dock)
(destiny ?c - conveyor ?d - dock)
(isgreen ?b - (either pallet box))
(ready ?b - (either box pallet) ?d - dock)
)

(:action unstack
    :parameters (?b1 - box ?b2 - (either pallet box) ?c - crane ?d - dock)
    :precondition (and  (at ?b1 ?d) ;la caja está en un muelle
                        (at ?c ?d) ;la grúa esta en el mismo muelle
                        (clear ?b1) ;no hay nada sobre b1
                        (clear ?c) ;no hay nada en la grúa
                        (on ?b1 ?b2)) ;b1 encima de una caja o pallet
    :effect (and    (not (clear ?b1)) ;b1  deja de estar en una stack
                    (not (clear ?c)) ;la grúa  no está libre
                    (not (on ?b1 ?b2)) ;b1 deja de estar sobre b2
                    (not (ready ?b1 ?d)) ;la caja b1 deja de estar ready en el dock d
                    (ready ?b2 ?d) ;la caja está ready
                    (on ?b1 ?c) ;b1 ahora está en la grúa
                    (clear ?b2) ;b2 ahora no tiene nada encima

                    )
)

(:action stack_gog
    :parameters (?b1 - box ?b2 - box ?c - crane ?d - dock)
    :precondition (and  (on ?b1 ?c) ;caja sujeta por la grua
                        (clear ?b2) ;nada encima de b2 
                        (at ?c ?d) ;crane  en el mismo dock que b2
                        (at ?b2 ?d)
                        (isgreen ?b1) ;b1 es caja green para delivery
                        (isgreen ?b2) ;b2 es caja green para delivery
    )
    :effect (and    (not (on ?b1 ?c)) ;b1 no está en el crane ya
                    (not (clear ?b2)) ;b2 tiene cosas encima ahora
                    (on ?b1 ?b2) ;b1 encima de b2
                    (clear ?c) ;crane vacío
                    (clear ?b1) ;b1 no tiene nada encima
                    (ready ?b1 ?d) ;b1 está ready (no borramos b2)
                    )
)


(:action stack_wgowp
    :parameters (?b1 - box ?b2 - (either pallet box) ?c - crane ?d - dock)
    :precondition (and  (on ?b1 ?c) ;caja sujeta por la grua
                        (clear ?b2) ;nada encima de b2 
                        (at ?c ?d) ;crane  en el mismo dock que b2
                        (at ?b2 ?d)
                        (not (isgreen ?b2)) 
    )
    :effect (and    (not (on ?b1 ?c)) ;b1 no está en el crane ya
                    (not (clear ?b2)) ;b2 tiene cosas encima ahora
                    (not (ready ?b2 ?d)) ;b2 deja de estar ready
                    (on ?b1 ?b2) ;b1 encima de b2
                    (clear ?c) ;crane vacío
                    (clear ?b1) ;b1 no tiene nada encima
                    (ready ?b1 ?d) ;b1 está ready (no borramos b2)
                    )
)

(:action load_conveyor
    :parameters (?b - box ?cr - crane ?c - conveyor ?d_og - dock ?d_dst - dock)
    :precondition (and  (on ?b ?cr) ;box is on a crane
                        (clear ?c) ;conveyor is clear
                        (origin ?c ?d_og) ;conveyor starts at d_og
                        (destiny ?c ?d_dst) ;conveyor ends at d_dst
                        (at ?cr ?d_og) ;crane is at dock origin
                        )
    :effect (and    (not (on ?b ?cr)) ;box not on crane
                    (clear ?cr) ;crane is clear
                    (not (clear ?c)) ;conveyor is not clear
                    (on ?b ?c) ;box is on conveyor 
                    (not (at ?b ?d_og))
                    (at ?b ?d_dst) ;box is now on dst dockc
    )
)

(:action unload_conveyor
    :parameters (?b - box ?c - conveyor ?cr - crane ?d - dock)
    :precondition (and  (on ?b ?c) ;caja en conveyor
                        (at ?b ?d) ;caja en el muelle
                        (at ?cr ?d) ;crane en el muelle
                        (clear ?cr) ;crane libre
    )
    :effect (and    (not (on ?b ?c))
                    (clear ?c)
                    (not (clear ?cr))
                    (on ?b ?cr)
    )
)
)

; problem
(define (problem unstack_simple) (:domain dominio)
(:objects
b1 b2 b3 b4 b5 - box
cr cr2 - crane
p1 p2 p3 p4 - pallet
d1 d2 - dock
c c2 - conveyor
)

(:init
(at p1 d1)
(at p2 d1)
(at p3 d2)
(at p4 d2)
(at b1 d2)
(at b2 d2)
(at b3 d2)
(at b4 d1)
(at b5 d1)
(at cr d1)
(at cr2 d2)
(on b4 p1)
(on b5 b4)
(on b1 p3)
(on b3 p4)
(on b2 b3)
(clear b2)
(clear b1)
(clear b5)
(clear p2)
(clear cr)
(clear cr2)
(clear c)
(clear c2)
(origin c d1)
(destiny c d2)
(origin c2 d2)
(destiny c2 d1)
(isgreen b1)
(isgreen b3)
(isgreen b4)
(ready b5 d1)
(ready b2 d2)
(ready b1 d2)
(ready p2 d1)
(ready b1 d2)
    ;todo: put the initial state's facts and numeric values here
)

(:goal (and
(ready b4 d1)
(ready b1 d1)
(ready b3 d1)
))

)

; plan
1. (unstack b1 p3 cr2 d2)
   deleted: (clear b1) (clear cr2) (on b1 p3) (ready b1 d2)
   added: (ready p3 d2) (on b1 cr2) (clear p3)
   goals met: 0 of 3
2. (load_conveyor b1 cr2 c2 d2 d1)
   deleted: (on b1 cr2) (clear c2) (at b1 d2)
   added: (clear cr2) (on b1 c2) (at b1 d1)
   goals met: 0 of 3
3. (unload_conveyor b1 c2 cr d1)
   deleted: (on b1 c2) (clear cr)
   added: (clear c2) (on b1 cr)
   goals met: 0 of 3
4. (unstack b2 b3 cr2 d2)
   deleted: (clear b2) (clear cr2) (on b2 b3) (ready b2 d2)
   added: (ready b3 d2) (on b2 cr2) (clear b3)
   goals met: 0 of 3
5. (stack_wgowp b1 p2 cr d1)
   deleted: (on b1 cr) (clear p2) (ready p2 d1)
   added: (on b1 p2) (clear cr) (clear b1) (ready b1 d1)
   goals met: 1 of 3
6. (stack_wgowp b2 p3 cr2 d2)
   deleted: (on b2 cr2) (clear p3) (ready p3 d2)
   added: (on b2 p3) (clear cr2) (clear b2) (ready b2 d2)
   goals met: 1 of 3
7. (unstack b3 p4 cr2 d2)
   deleted: (clear b3) (clear cr2) (on b3 p4) (ready b3 d2)
   added: (ready p4 d2) (on b3 cr2) (clear p4)
   goals met: 1 of 3
8. (unstack b5 b4 cr d1)
   deleted: (clear b5) (clear cr) (on b5 b4) (ready b5 d1)
   added: (ready b4 d1) (on b5 cr) (clear b4)
   goals met: 2 of 3
9. (load_conveyor b3 cr2 c2 d2 d1)
   deleted: (on b3 cr2) (clear c2) (at b3 d2)
   added: (clear cr2) (on b3 c2) (at b3 d1)
   goals met: 2 of 3
10. (load_conveyor b5 cr c d1 d2)
   deleted: (on b5 cr) (clear c) (at b5 d1)
   added: (clear cr) (on b5 c) (at b5 d2)
   goals met: 2 of 3
11. (unload_conveyor b3 c2 cr d1)
   deleted: (on b3 c2) (clear cr)
   added: (clear c2) (on b3 cr)
   goals met: 2 of 3
12. (stack_gog b3 b4 cr d1)
   deleted: (on b3 cr) (clear b4)
   added: (on b3 b4) (clear cr) (clear b3) (ready b3 d1)
   goals met: 3 of 3
